Masmiseim36/nxpSDK/boards/evkmimxrt1180/demo_apps/mc_pmsm/pmsm_enc/cm7/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_13 (coord N15), TP1 */
/* Routed pin properties */
#define BOARD_INITPINS_TP1_PERIPHERAL                                     RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_TP1_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP1_CHANNEL                                           13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP1_GPIO                                           RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP1_GPIO_PIN                                          13U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP1_GPIO_PIN_MASK                             (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_AD_12 (coord P17), TP2 */
/* Routed pin properties */
#define BOARD_INITPINS_TP2_PERIPHERAL                                     RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_TP2_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP2_CHANNEL                                           12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP2_GPIO                                           RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP2_GPIO_PIN                                          12U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP2_GPIO_PIN_MASK                             (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_AD_27 (coord M16), USER_LED1 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED1_PERIPHERAL                               RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED1_CHANNEL                                     27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED1_GPIO                                     RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED1_GPIO_PIN                                    27U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED1_GPIO_PIN_MASK                       (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_AD_08 (coord T14), TP0 */
/* Routed pin properties */
#define BOARD_INITPINS_TP0_PERIPHERAL                                     RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_TP0_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP0_CHANNEL                                            8U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP0_GPIO                                           RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP0_GPIO_PIN                                           8U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP0_GPIO_PIN_MASK                              (1U << 8U)   /*!< GPIO pin mask */

/* GPIO_AON_04 (coord B4), SW8 */
/* Routed pin properties */
#define BOARD_INITPINS_SW8_PERIPHERAL                                     RGPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_SW8_SIGNAL                                        gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SW8_CHANNEL                                            4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW8_GPIO                                           RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SW8_GPIO_PIN                                           4U   /*!< GPIO pin number */
#define BOARD_INITPINS_SW8_GPIO_PIN_MASK                              (1U << 4U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_AD_06 (coord N13), CUR_A */
/* Routed pin properties */
#define BOARD_INITADC_CUR_A1_PERIPHERAL                                     ADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_A1_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITADC_CUR_A1_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_AD_21 (coord K15), CUR_A */
/* Routed pin properties */
#define BOARD_INITADC_CUR_A2_PERIPHERAL                                     ADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_A2_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITADC_CUR_A2_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_AD_07 (coord T17), CUR_B */
/* Routed pin properties */
#define BOARD_INITADC_CUR_B_PERIPHERAL                                      ADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_B_SIGNAL                                             B   /*!< Signal name */
#define BOARD_INITADC_CUR_B_CHANNEL                                           1U   /*!< Signal channel */

/* GPIO_AD_22 (coord K12), CUR_C */
/* Routed pin properties */
#define BOARD_INITADC_CUR_C_PERIPHERAL                                      ADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_C_SIGNAL                                             A   /*!< Signal name */
#define BOARD_INITADC_CUR_C_CHANNEL                                           2U   /*!< Signal channel */

/* GPIO_AD_09 (coord R16), VOLT_DCB */
/* Routed pin properties */
#define BOARD_INITADC_VOLT_DCB_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define BOARD_INITADC_VOLT_DCB_SIGNAL                                          B   /*!< Signal name */
#define BOARD_INITADC_VOLT_DCB_CHANNEL                                        1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_AD_00 (coord N12), PWM_AT */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_AT_PERIPHERAL                                     PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_AT_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITPWM_PWM_AT_CHANNEL                                          0U   /*!< Signal channel */

/* GPIO_AD_01 (coord R14), PWM_AB */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_AB_PERIPHERAL                                     PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_AB_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITPWM_PWM_AB_CHANNEL                                          0U   /*!< Signal channel */

/* GPIO_AD_02 (coord R13), PWM_BT */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_BT_PERIPHERAL                                     PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_BT_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITPWM_PWM_BT_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_AD_03 (coord R15), PWM_BB */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_BB_PERIPHERAL                                     PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_BB_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITPWM_PWM_BB_CHANNEL                                          1U   /*!< Signal channel */

/* GPIO_AD_05 (coord P13), PWM_CT */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_CT_PERIPHERAL                                     PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_CT_SIGNAL                                            A   /*!< Signal name */
#define BOARD_INITPWM_PWM_CT_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_AD_04 (coord P15), PWM_CB */
/* Routed pin properties */
#define BOARD_INITPWM_PWM_CB_PERIPHERAL                                     PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_PWM_CB_SIGNAL                                            B   /*!< Signal name */
#define BOARD_INITPWM_PWM_CB_CHANNEL                                          2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);                  /* Function assigned for the Cortex-M7F */

#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_17_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT17 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_18_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT18 function direction select: XBAR_INOUT as input */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP(void);                     /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
